import React from 'react';
import Home from '../components/Home';
import Footer from '../components/Footer';

const Terms = () => {
    return (
        <div className='glavniy'style={{ backgroundColor: '#000000', height: "100%", }}>
        <div className='container' style={{alignContent:'center'}}> 
        <Home/>
         <div style={{color:'white',width:'50vw'}}>

       <h1>  Условия использования</h1>
<h4>1. Введение</h4>
Добро пожаловать на наш сайт! Пожалуйста, внимательно прочитайте эти Условия использования перед тем, как начать пользоваться нашим сайтом. Пользуясь нашим сайтом, вы соглашаетесь соблюдать эти условия. Если вы не согласны с этими условиями, пожалуйста, прекратите использование нашего сайта.

<h4>2. Использование сайта</h4>
Вы обязуетесь использовать сайт в соответствии с действующим законодательством и не использовать его для незаконных целей или для распространения вредоносного программного обеспечения. Вы также обязуетесь не совершать действия, которые могут нарушить работу сайта или помешать другим пользователям использовать сайт.

<h4>3. Регистрация и учетная запись</h4>
Для доступа к некоторым функциям сайта может потребоваться регистрация. Вы соглашаетесь предоставлять точную и актуальную информацию при регистрации. Вы несете ответственность за сохранение конфиденциальности своих учетных данных и за все действия, которые происходят под вашим аккаунтом.

<h4>4. Конфиденциальность</h4>
Мы уважаем вашу конфиденциальность и обязуемся защищать вашу личную информацию. Пожалуйста, ознакомьтесь с нашей Политикой конфиденциальности, чтобы узнать больше о том, как мы собираем, используем и защищаем вашу информацию.

<h4>5. Интеллектуальная собственность</h4>
Все материалы, представленные на нашем сайте, включая тексты, изображения, графику, логотипы и программное обеспечение, являются нашей собственностью или собственностью наших лицензиаров и защищены законами об авторском праве и других правах интеллектуальной собственности. Вы не имеете права копировать, изменять, распространять или использовать материалы сайта без нашего явного письменного разрешения.

<h4>6. Ограничение ответственности</h4>
Мы не несем ответственности за любые убытки или ущерб, возникающие в результате использования нашего сайта или невозможности его использования, включая, но не ограничиваясь, потерю данных, доходов или прибыли.

<h4>7. Изменения условий</h4>
Мы оставляем за собой право изменять эти Условия использования в любое время без предварительного уведомления. Изменения вступают в силу с момента их публикации на сайте. Продолжая использовать сайт после внесения изменений, вы соглашаетесь соблюдать обновленные условия.

<h4>8. Прекращение использования</h4>
Мы оставляем за собой право прекратить или ограничить ваш доступ к сайту в любое время без предварительного уведомления, если вы нарушите эти Условия использования или если мы сочтем такое действие необходимым для обеспечения безопасности и защиты нашего сайта и пользователей.

<h4>9. Контактная информация</h4>
Если у вас есть вопросы или предложения по поводу этих Условий использования, пожалуйста, свяжитесь с нами по адресу [ваша контактная информация].

         </div>
          <Footer/>
        </div>
        </div>
    );
};

export default Terms;